set_option_power_zone = [
    '-os 72=[11:1:11:17:32:36]',
    '-os 73=[12:2:12:18:33:37]',
    '-os 74=[13:3:13:19:34:38]',
    '-os 75=[14:4:14:20:35:39]',
    '-os 76=[15:5:15:21:36:40]',
    '-os 77=[16:6:16:22:37:41]',
    '-os 78=[17:7:17:23:38:42]',
    '-os 79=[18:8:18:24:39:43]',
    '-os 80=[19:9:19:25:40:44]',
    '-os 81=[20:10:20:26:41:45]',
    '-os 82=[21:11:21:27:42:46]',
    '-os 83=[22:12:22:28:43:47]'
]

options_power_limit_list = [
    #  Загрузка режима контроля мощности «Контроль включен» , режим контроля «по расписанию зон контроля»
    # [84,"[2:1:1:4:1]"],
    # Загрузка лимитов мощности
    "-os 85=0.123",  # LimP_1_morning
    "-os 86=0.223",  # LimP_2_morning
    "-os 87=0.323",  # LimP_3_morning
    "-os 88=0.423",  # LimP_4_morning
    "-os 89=0.523",  # LimP_5_morning
    "-os 90=0.623",  # LimP_6_morning
    "-os 91=0.723",  # LimP_7_morning
    "-os 92=0.823",  # LimP_8_morning
    "-os 93=0.923",  # LimP_9_morning
    "-os 94=1.023",  # LimP_10_morning
    "-os 95=1.123",  # LimP_11_morning
    "-os 96=1.223",  # LimP_12_morning
    "-os 97=0.124",  # LimP_1_evening
    "-os 98=0.224",  # LimP_2_evening
    "-os 99=0.324",  # LimP_3_evening
    "-os 100=0.424",  # LimP_4_evening
    "-os 101=0.524",  # LimP_5_evening
    "-os 102=0.624",  # LimP_6_evening
    "-os 103=0.724",  # LimP_7_evening
    "-os 104=0.824",  # LimP_8_evening
    "-os 105=0.924",  # LimP_9_evening
    "-os 106=1.024",  # LimP_10_evening
    "-os 107=1.124",  # LimP_11_evening
    "-os 108=1.224",  # LimP_12_evening

]

# режим "контроль выключен"
options_setLimP_off = [
    "-os 84=[0:1:0:4:0]"
]

# режим «Контроль включен» , режим контроля «всегда»
options_setLimP_on_all = [
    "-os 84=[0:1:0:4:1]"
]

# Загрузка режима контроля мощности «Контроль включен» , режим контроля «по назначенному тарифу»
options_setLimP_on_tarif = [
    "-os 84=[1:1:0:4:1]"
]

# Загрузка режима контроля мощности «Контроль включен» , режим контроля «по расписанию зон контроля»
options_setLimP_on_zone = [
    "-os 84=[2:1:0:4:1]"
]

datechk = [
    [11, 1],
    [12, 2],
    [13, 3],
    [14, 4],
    [15, 5],
    [16, 6],
    [17, 7],
    [18, 8],
    [19, 9],
    [20, 10],
    [21, 11],
    [22, 12]
]
